## Exercise Questions
* importing the data from csv
* importing the data from csv with custom header list (dob, photo_taken, full_path, gender, name, face_score, second_face_score)
* describe the dataset
* how to print the columns
* Use some dataframe function like head(), info(), desc()
* filter dataframe using list comprehension by photo taken between 1970 and 1980
* create a dataframe where gender is not null
* Merge, Append, Concat
 - create two dataframes named as "first" (id, dob, photo_taken) and "second" (id, gender, name)
 - create a "third" dataframe by mergining above two
 - create a "fourth" dataframe by concating first and second columnswise
 - create a "five" dataframe by appending the 100 records from both dataframes

* Fetch filename from full_path by function or lambda function and store in new column called "filename". (Note, remove ' (quotes) from string)
-  '01/nm0000001_rm124825600_1899-5-10_1968.jpg' ---> nm0000001_rm124825600_1899-5-10_1968.jpg

**Use this link for data -** https://raw.githubusercontent.com/ggbsacet/machine-learning/master/datasets/pandas-exercise.csv

In [21]:
import pandas as pd

In [22]:
data = pd.read_csv("https://raw.githubusercontent.com/ggbsacet/machine-learning/master/datasets/pandas-exercise.csv")

In [24]:
custom_data = pd.read_csv("https://raw.githubusercontent.com/ggbsacet/machine-learning/master/datasets/pandas-exercise.csv",
                          usecols=['dob', 'photo_taken', 'full_path', 'gender', 'name', 'face_score', 'second_face_score'])

In [26]:
data.describe()

                id            dob  ...  second_face_score      celeb_id
count  10000.00000   10000.000000  ...        5552.000000  10000.000000
mean    4999.50000  714613.637200  ...           2.437146  11024.150600
std     2886.89568    5941.266765  ...           1.015429   5418.425735
min        0.00000  691751.000000  ...           0.731509    213.000000
25%     2499.75000  713912.000000  ...           1.618010   6778.000000
50%     4999.50000  716686.000000  ...           2.376602  10939.000000
75%     7499.25000  717544.000000  ...           3.147927  15548.000000
max     9999.00000  721407.000000  ...           5.852816  20096.000000

[8 rows x 7 columns]

In [28]:
# Print the colums
data.columns

Index(['id', 'dob', 'photo_taken', 'full_path', 'gender', 'name',
       'face_location', 'face_score', 'second_face_score', 'celeb_names',
       'celeb_id'],
      dtype='object')

In [29]:
data.head(10)

   id     dob  ...              celeb_names celeb_id
0   0  693726  ...  "'Lee' George Quinones"     6488
1   1  693726  ...    "'Weird Al' Yankovic"     6488
2   2  693726  ...               '2 Chainz'     6488
3   3  693726  ...                '50 Cent'     6488
4   4  693726  ...             'A Martinez'     6488
5   5  702986  ...             'A.D. Miles'    11516
6   6  702986  ...           'A.J. Buckley'    11516
7   7  702986  ...              'A.J. Cook'    11516
8   8  702986  ...           'A.J. Johnson'    11516
9   9  702986  ...            'A.J. Langer'    11516

[10 rows x 11 columns]

In [30]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 10000 non-null  int64
 1   dob                10000 non-null  int64
 2   photo_taken        10000 non-null  int64
 3   full_path          10000 non-null  object
 4   gender             9997 non-null   float64
 5   name               10000 non-null  object
 6   face_location      10000 non-null  object
 7   face_score         10000 non-null  float64
 8   second_face_score  5552 non-null   float64
 9   celeb_names        10000 non-null  object
 10  celeb_id           10000 non-null  int64
dtypes: float64(3), int64(4), object(4)
memory usage: 859.5+ KB

In [34]:
photo = data[(data["photo_taken"] > 1970) & (data["photo_taken"] < 1980)]
photo.shape

(315, 11)

In [35]:
gender = data[data["gender"].isna() == False]

In [36]:
gender.shape

(9997, 11)

In [38]:
first = data[["id", "dob", "photo_taken"]]
second = data[["id", "gender", "name"]]

In [39]:
first.shape, second.shape

((10000, 3), (10000, 3))

In [40]:
third = second.merge(first, on=['id'])

In [41]:
third.shape

(10000, 5)

In [42]:
fourth = pd.concat([first, second], axis=1)

In [43]:
fourth.shape

(10000, 6)

In [46]:
five = first.head(100).append(second.head(100))

In [47]:
five.shape

(200, 5)

In [49]:
five.head()

   id       dob  photo_taken  gender name
0   0  693726.0       1968.0     NaN  NaN
1   1  693726.0       1970.0     NaN  NaN
2   2  693726.0       1968.0     NaN  NaN
3   3  693726.0       1968.0     NaN  NaN
4   4  693726.0       1968.0     NaN  NaN

In [50]:
five.tail()

    id  dob  photo_taken  gender             name
95  95  NaN          NaN     1.0  'Marlon Brando'
96  96  NaN          NaN     1.0  'Marlon Brando'
97  97  NaN          NaN     1.0  'Marlon Brando'
98  98  NaN          NaN     1.0  'Marlon Brando'
99  99  NaN          NaN     1.0  'Marlon Brando'

In [52]:
data[["id", "photo_taken", "full_path"]].head()

   id  photo_taken                                       full_path
0   0         1968   '01/nm0000001_rm124825600_1899-5-10_1968.jpg'
1   1         1970  '01/nm0000001_rm3343756032_1899-5-10_1970.jpg'
2   2         1968   '01/nm0000001_rm577153792_1899-5-10_1968.jpg'
3   3         1968   '01/nm0000001_rm946909184_1899-5-10_1968.jpg'
4   4         1968   '01/nm0000001_rm980463616_1899-5-10_1968.jpg'

In [56]:
data["filename"] = data["full_path"].apply(lambda path : path.replace("'", "").split('/')[1])

In [57]:
data[["id", "photo_taken", "full_path", "filename"]].head()

   id  ...                                   filename
0   0  ...   nm0000001_rm124825600_1899-5-10_1968.jpg
1   1  ...  nm0000001_rm3343756032_1899-5-10_1970.jpg
2   2  ...   nm0000001_rm577153792_1899-5-10_1968.jpg
3   3  ...   nm0000001_rm946909184_1899-5-10_1968.jpg
4   4  ...   nm0000001_rm980463616_1899-5-10_1968.jpg

[5 rows x 4 columns]

In [59]:
data["full_path"].apply(lambda path : path.replace("'", "").split('/'))[0]

['01', 'nm0000001_rm124825600_1899-5-10_1968.jpg']

In [67]:
s = "a,b,c,d,e,f"
# s = ['a', 'b' ,'c' ,'d', 'e', 'f']

ss = s.split(",")

print(ss[3])

d